Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2455.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="18xxxx" edc:clonedfrom="PIC18F2455" edc:desc="" edc:dosid="00284" edc:dsid="30009632" edc:informedby="DOS PS DS" edc:masksetid="" edc:name="PIC18LF2455" edc:procid="0xA20B" edc:psid="30009622" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:isextended="true">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="12.000" edc:maxvoltage="12.500" edc:minvoltage="9.500"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true" edc:lvpthresh="3.000" edc:memtech="ee" edc:panelsize="0x0" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="eedata" edc:time="4000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="64" edc:progop="rowerase"/>
    <edc:ProgrammingRowSize edc:nzsize="32" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="8" edc:progop="userid"/>
    <edc:Wait edc:lverase="1000" edc:lvpgm="1000" edc:erase="10000" edc:pgm="1000" edc:cfg="5000" edc:eedata="4000" edc:userid="5000"/>
    <edc:Latches edc:rowerase="64" edc:pgm="32" edc:cfg="2" edc:eedata="2" edc:userid="8"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="16" edc:hwstackdepth="31">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0xf00000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="egg"/>
  <edc:Oscillator>
    <edc:OscillatorMode edc:id="0" edc:max="48000000" edc:min="4000000"/>
    <edc:OscillatorMode edc:id="1" edc:max="25000000" edc:min="4000000"/>
    <edc:OscillatorMode edc:id="6" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="7" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="8" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="9" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="10" edc:max="4000000" edc:min="100000"/>
    <edc:OscillatorMode edc:id="11" edc:max="4000000" edc:min="100000"/>
  </edc:Oscillator>
  <edc:WatchdogTimer edc:min="4"/>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="0x3" edc:idbyte="p"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x6000" edc:regionid="page"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200040" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200008" edc:regionid="idlocs"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x30000e" edc:regionid="config">
      <edc:DCRDef edc:access="--nnnnnn" edc:cname="CONFIG1L" edc:desc="" edc:factorydefault="0x0" edc:impl="0x3f" edc:name="CONFIG1L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x3f" edc:default="0x0" edc:_addr="0x300000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="PLLDIV" edc:desc="PLL Prescaler Selection bits" edc:mask="0x7" edc:name="PLLDIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="12" edc:desc="Divide by 12 (48 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="10" edc:desc="Divide by 10 (40 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="6" edc:desc="Divide by 6 (24 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="5" edc:desc="Divide by 5 (20 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="4" edc:desc="Divide by 4 (16 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="3" edc:desc="Divide by 3 (12 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="Divide by 2 (8 MHz oscillator input)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="No prescale (4 MHz oscillator input drives PLL directly)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPUDIV" edc:desc="System Clock Postscaler Selection bits" edc:mask="0x3" edc:name="CPUDIV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OSC4_PLL6" edc:desc="[Primary Oscillator Src: /4][96 MHz PLL Src: /6]" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="OSC3_PLL4" edc:desc="[Primary Oscillator Src: /3][96 MHz PLL Src: /4]" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OSC2_PLL3" edc:desc="[Primary Oscillator Src: /2][96 MHz PLL Src: /3]" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OSC1_PLL2" edc:desc="[Primary Oscillator Src: /1][96 MHz PLL Src: /2]" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBDIV" edc:desc="USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1)" edc:mask="0x1" edc:name="USBDIV" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="USB clock source comes from the 96 MHz PLL divided by 2" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="USB clock source comes directly from the primary oscillator block with no postscale" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn--nnnn" edc:cname="CONFIG1H" edc:desc="" edc:factorydefault="0x5" edc:impl="0xcf" edc:name="CONFIG1H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xcf" edc:default="0x5" edc:_addr="0x300001">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection bits" edc:mask="0xf" edc:name="FOSC" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="HSPLL_HS" edc:desc="HS oscillator, PLL enabled (HSPLL)" edc:oscmodeidref="0" edc:when="(field &amp; 0xe) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator (HS)" edc:oscmodeidref="1" edc:when="(field &amp; 0xe) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="INTOSC_HS" edc:desc="Internal oscillator, HS oscillator used by USB (INTHS)" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="INTOSC_XT" edc:desc="Internal oscillator, XT used by USB (INTXT)" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="INTOSC_EC" edc:desc="Internal oscillator, CLKO function on RA6, EC used by USB (INTCKO)" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="INTOSCIO_EC" edc:desc="Internal oscillator, port function on RA6, EC used by USB (INTIO)" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="ECPLL_EC" edc:desc="EC oscillator, PLL enabled, CLKO function on RA6 (ECPLL)" edc:oscmodeidref="6" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="ECPLLIO_EC" edc:desc="EC oscillator, PLL enabled, port function on RA6 (ECPIO)" edc:oscmodeidref="7" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="EC_EC" edc:desc="EC oscillator, CLKO function on RA6 (EC)" edc:oscmodeidref="8" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="ECIO_EC" edc:desc="EC oscillator, port function on RA6 (ECIO)" edc:oscmodeidref="9" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="XTPLL_XT" edc:desc="XT oscillator, PLL enabled (XTPLL)" edc:oscmodeidref="10" edc:when="(field &amp; 0xe) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT_XT" edc:desc="XT oscillator (XT)" edc:oscmodeidref="11" edc:when="(field &amp; 0xe) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor Enable bit" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal/External Oscillator Switchover bit" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Oscillator Switchover mode enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator Switchover mode disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--nnnnnn" edc:cname="CONFIG2L" edc:desc="" edc:factorydefault="0x1f" edc:impl="0x3f" edc:name="CONFIG2L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x3f" edc:default="0x1f" edc:_addr="0x300002">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="PWRT" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOR" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOR" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset enabled in hardware only (SBOREN is disabled)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ON_ACTIVE" edc:desc="Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SOFT" edc:desc="Brown-out Reset enabled and controlled by software (SBOREN is enabled)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset disabled in hardware and software" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage bits" edc:mask="0x3" edc:name="BORV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="3" edc:desc="Minimum setting" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="0" edc:desc="Maximum setting" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VREGEN" edc:desc="USB Voltage Regulator Enable bit" edc:mask="0x1" edc:name="VREGEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USB voltage regulator enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USB voltage regulator disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
